In [2]:
import pandas as pd

In [3]:
cars = ['bmw','mercedes','audi']

In [4]:
cars

['bmw', 'mercedes', 'audi']

In [5]:
pd.Series(cars)

0         bmw
1    mercedes
2        audi
dtype: object

In [6]:
fav = pd.Series(cars, index=['240','c43','A5'])

In [7]:
fav

240         bmw
c43    mercedes
A5         audi
dtype: object

In [10]:
fav.iloc[2]

'audi'

In [12]:
fav.loc['240']

'bmw'

In [13]:
len(fav)

3

In [14]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [15]:
df

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod